yuangezhizao/WT9932P4-TINY/sdkconfig.defaults
# WT9932P4-TINY 工程默认配置（idf.py 首次构建 / 重置 sdkconfig 时读取）

# 1) 固定构建目标为 ESP32-P4：保证全新环境（无 sdkconfig）执行 idf.py build 开箱即用、不回退到默认 esp32 目标，并与 CI（.github/workflows/build-esp-idf-project.yml 的 ESP_IDF_TARGET: ESP32P4）一致。
CONFIG_IDF_TARGET="esp32p4"

# 2) 默认激活 demo（blink）的默认配置（仅在激活 main_blink_example.c 时才有运行时意义；其它 demo 下这些符号仍写入生成的 sdkconfig，只是不被读取）：板载 RGB 走可寻址 led_strip + GPIO51。
CONFIG_BLINK_LED_STRIP=y
CONFIG_BLINK_GPIO=51
